[{"text":"I prefer to use proper grammar and spelling online.","effect":[10,0,0,0,0,0,0],"flags":1},{"text":"I like to elaborate with long genuine sentiments or explanations.","effect":[10,0,0,0,0,0,0],"flags":1},{"text":"I usually don't enjoy posting memes.","effect":[10,0,0,0,0,0,0],"flags":0},{"text":"Our community is a place where we should have serious discussions or debates.","effect":[10,0,0,0,0,0,0],"flags":1},{"text":"There's something wrong with intentional misspellings and acting \"silly\" for the sake of it.","effect":[10,0,0,0,0,0,0],"flags":0},{"text":"I mean what I say and say what I mean.","effect":[10,0,0,0,0,0,0],"flags":1},{"text":"I enjoy reading and typing long drawn out \"essayposts\" or walls of text.","effect":[10,0,0,0,0,0,0],"flags":0},{"text":"I present myself in a way that's decidedly different, adding a sort of \"special creativity\" to my personality.","effect":[-10,0,0,0,0,0,0],"flags":0},{"text":"My politics seem to change based on who I'm trolling.","effect":[-10,0,0,0,0,0,0],"flags":1},{"text":"Nothing wrong with some good old fashioned online larping, no need to be so serious or genuine.","effect":[-10,0,0,0,0,0,0],"flags":0},{"text":"I type in an particular way with a lot of emoticons and text faces :3","effect":[-10,0,0,0,0,0,0],"flags":0},{"text":"I joke around a lot.","effect":[-10,0,0,0,0,0,0],"flags":1},{"text":"Engaging in a way that emphasizes lighthearted fun is my preferred way to go about things.","effect":[-10,0,0,0,0,0,0],"flags":1},{"text":"I make things up about my ideology to joke around with or impress others.","effect":[-10,0,0,0,0,0,0],"flags":0},{"text":"I'd like to give a warm welcome to people just entering a community that I'm established in.","effect":[0,10,0,0,0,0,0],"flags":0},{"text":"When I want something, I ask politely, with please, without pressure, giving thanks.","effect":[0,10,0,0,0,0,0],"flags":1},{"text":"It hurts me to see others suffer, even if they have wronged me.","effect":[0,10,0,0,0,0,0],"flags":1},{"text":"I care about those who are less fortunate and I want to do things to help.","effect":[0,10,0,0,0,0,0],"flags":1},{"text":"I'm here to make friends, not enemies.","effect":[0,10,0,0,0,0,0],"flags":1},{"text":"I want to resolve drama, conflicts, and beef, ensuring everyone gets along with each other.","effect":[0,10,0,0,0,0,0],"flags":0},{"text":"I refrain from name-calling, swearing, and threatening.","effect":[0,10,0,0,0,0,0],"flags":0},{"text":"People would not come to me for advice or emotional support/help, or if they did, I would turn them away.","effect":[0,-10,0,0,0,0,0],"flags":0},{"text":"There is no need for genuine feel-good interactions, I prefer keeping things unemotional.","effect":[0,-10,0,0,0,0,0],"flags":0},{"text":"I say things solely to alienate or anger others.","effect":[0,-10,0,0,0,0,0],"flags":1},{"text":"I don't allow myself to be pushed around by others, I do what I want.","effect":[0,-10,0,0,0,0,0],"flags":0},{"text":"I don't have faith in humanity, people are not good, the world is cold and harsh.","effect":[0,-10,0,0,0,0,0],"flags":1},{"text":"Others don't deserve what I have.","effect":[0,-10,0,0,0,0,0],"flags":0},{"text":"I have been called callous, insensitive, remorseless, or an \"edgelord\"","effect":[0,-10,0,0,0,0,0],"flags":1},{"text":"Those who advocate for unequal treatment of minorities should be handled stricly by moderation, or deplatformed.","effect":[0,0,10,0,0,0,0],"flags":1},{"text":"We should be more strict about censoring support for slavery, fascism, and totalitarianism.","effect":[0,0,10,0,0,0,0],"flags":1},{"text":"We must ensure support for queer identities.","effect":[0,0,10,0,0,0,0],"flags":1},{"text":"Transgender individuals should be accepted, their pronouns respected, and their identities should be recognized.","effect":[0,0,10,0,0,0,0],"flags":1},{"text":"Reactionary ideologies such as Nazism shouldn't be allowed within our community.","effect":[0,0,10,0,0,0,0],"flags":0},{"text":"Ethnic and national backgrounds should not be a factor that others are judged by.","effect":[0,0,10,0,0,0,0],"flags":1},{"text":"We should allow pro-eugenics views in our discussions.","effect":[0,0,-10,0,0,0,0],"flags":1},{"text":"Throughout history, there have been misconceptions about China, North Korea, and Russia. It's reasonable to defend these states at times.","effect":[0,0,-10,0,0,0,0],"flags":1},{"text":"Despite the policies of our social media platform, we should allow and therefore not moderate leaking classified/military info and posting weapon/drug instructions.","effect":[0,0,-10,0,0,0,0],"flags":0},{"text":"My opinions could easily get me cancelled as they go against the woke narrative.","effect":[0,0,-10,0,0,0,0],"flags":0},{"text":"Political correctness has gone too far, we shouldn't have to be so careful about offending people.","effect":[0,0,-10,0,0,0,0],"flags":1},{"text":"It's acceptable to value some people less because they are part of a group that commits more crime on average.","effect":[0,0,-10,0,0,0,0],"flags":1},{"text":"Those who are politically illiterate should read theory before posting political commentary.","effect":[0,0,0,10,0,0,0],"flags":1},{"text":"I do read or plan to read theory.","effect":[0,0,0,10,0,0,0],"flags":3},{"text":"I have read 10 or more political, economic, or philosophical written works","effect":[0,0,0,10,0,0,0],"flags":3},{"text":"I look down upon those who are clueless and uninformed about politics, economics, philosophy.","effect":[0,0,0,10,0,0,0],"flags":0},{"text":"Politics should come from reading, research, or debate.","effect":[0,0,0,10,0,0,0],"flags":1},{"text":"My views are based on my own insticts, values, and personal opinions that aren't derived from any particular thinker.","effect":[0,0,0,-10,0,0,0],"flags":1},{"text":"It's good to trust your gut and believe what truly feels right.","effect":[0,0,0,-10,0,0,0],"flags":0},{"text":"I'm not big on getting my views from reading, I tend to stay away from theory.","effect":[0,0,0,-10,0,0,0],"flags":1},{"text":"There's no need to let others influence my opinions; I can decide what's right by myself.","effect":[0,0,0,-10,0,0,0],"flags":0},{"text":"Beliefs are intuitive as opposed to being grounded in logic and reason.","effect":[0,0,0,-10,0,0,0],"flags":1},{"text":"Philosophy and economics are boring and needlessly complex subjects.","effect":[0,0,0,-10,0,0,0],"flags":0},{"text":"Politics should focus on real-world practically applicable solutions.","effect":[0,0,0,0,10,0,0],"flags":1},{"text":"My ideology is currently in implementation/practice somewhere.","effect":[0,0,0,0,10,0,0],"flags":2},{"text":"I disagree with many political positions based on how they are simply impractical, unworkable, or impossible.","effect":[0,0,0,10,0,0,0],"flags":1},{"text":"I don't give credence or validation to \"ideologies\" that I know would make society collapse if one were to try to implement them.","effect":[0,0,0,0,10,0,0],"flags":0},{"text":"Anything that couldn't possibly work in the real world, and/or isn't even meant to work in the real world, is not a real ideology.","effect":[0,0,0,0,10,0,0],"flags":1},{"text":"We should put our effort towards solving real problems, not dreaming up ideal worlds, idealism is naïve.","effect":[0,0,0,0,10,0,0],"flags":0},{"text":"There are whole communities that agree with my ideology, it's not far-fetched at all.","effect":[0,0,0,0,10,0,0],"flags":0},{"text":"My ideology belongs into far future or far past, modern humanity is not ready for it.","effect":[0,0,0,0,-10,0,0],"flags":0},{"text":"There's no use trying to implement my ideology in the real world.","effect":[0,0,0,0,-10,0,0],"flags":1},{"text":"I prefer imagination over revolution or reform.","effect":[0,0,0,0,-10,0,0],"flags":0},{"text":"I have a self-insert; a personal unique ideology that I believe in, which is different from pre-existing ideologies.","effect":[0,0,0,0,-10,0,0],"flags":1},{"text":"I will not compromise in my politics.","effect":[0,0,0,0,-10,0,0],"flags":0},{"text":"We should not dismiss things as \"utopian;\" dreams should be chased.","effect":[0,0,0,0,-10,0,0],"flags":1},{"text":"People in our community look up to me and respect me.","effect":[0,0,0,0,0,10,0],"flags":1},{"text":"When we rank members of our community according to personal opinion, others usually put me at the top of those lists.","effect":[0,0,0,0,0,10,0],"flags":0},{"text":"I often see positive things being said about me online.","effect":[0,0,0,0,0,10,0],"flags":1},{"text":"Generally, I have relatively few enemies within our community.","effect":[0,0,0,0,0,10,0],"flags":0},{"text":"If people tried to ban me or advocate for my removal, many more would come to my aid and oppose that.","effect":[0,0,0,0,0,10,0],"flags":1},{"text":"People see me as the incarnation of evil.","effect":[0,0,0,0,0,-10,0],"flags":0},{"text":"If I were to check what people in our community are saying about me, I would see a lot of negative comments and discussion of past incidents/mistakes.","effect":[0,0,0,0,0,-10,0],"flags":1},{"text":"I find myself often the target of insults and threats.","effect":[0,0,0,0,0,-10,0],"flags":1},{"text":"If I left the community, I would not be missed.","effect":[0,0,0,0,0,-10,0],"flags":1},{"text":"People tell me that I'm annoying.","effect":[0,0,0,0,0,-10,0],"flags":1},{"text":"Suggestive jokes and innuendos can be funny!","effect":[0,0,0,0,0,0,10],"flags":1},{"text":"Moderation is too strict on risqué content.","effect":[0,0,0,0,0,0,10],"flags":1},{"text":"People overreact to \"inappropriate\" remarks about community members.","effect":[0,0,0,0,0,0,10],"flags":0},{"text":"We should have an NSFW space or section in our community.","effect":[0,0,0,0,0,0,10],"flags":2},{"text":"I believe in libertine principles and I may be seen as hedonistic.","effect":[0,0,0,0,0,0,10],"flags":0},{"text":"I oppose prostitution.","effect":[0,0,0,0,0,0,-10],"flags":2},{"text":"People are too degenerate online.","effect":[0,0,0,0,0,0,-10],"flags":1},{"text":"Lewd content should be banned from our community.","effect":[0,0,0,0,0,0,-10],"flags":1},{"text":"People should *not* post obscene material or engage in adult-oriented discussions.","effect":[0,0,0,0,0,0,-10],"flags":1},{"text":"Reproductive organs and other indecent parts should not be mentioned.","effect":[0,0,0,0,0,0,-10],"flags":0}]